app/controllers/monsters_controller.rb

SELECT "monsters".* FROM "monsters"
---
  def index
    monsters = Monster.all

SELECT  "monsters".* FROM "monsters" WHERE "monsters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    monster = Monster.find(params[:id])

INSERT INTO "monsters" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Mr Moons"], ["description", "Mr Moons Description"], ["user_id", 7], ["created_at", "2018-08-28 14:34:25.126560"], ["updated_at", "2018-08-28 14:34:25.126560"]]
---
  def create
    monster = Monster.new(monster_params)
    monster.user = current_user
    if monster.save