app/controllers/users_controller.rb

INSERT INTO "users" ("auth_token", "created_at", "updated_at") VALUES (?, ?, ?)  [["auth_token", "dr4A79GMZFLzeVY2h3vvfBdg"], ["created_at", "2018-08-28 11:54:18.804837"], ["updated_at", "2018-08-28 11:54:18.804837"]]
---
  def create
    user = User.create!(user_params)

SELECT  "users".* FROM "users" WHERE "users"."auth_token" = ? LIMIT ?  [["auth_token", "m4Nj3e1SU4PvRfXGanV7vARE"], ["LIMIT", 1]]
---
  def profile
    user = User.find_by_auth_token!(request.headers[:token])

SELECT  "users".* FROM "users" WHERE "users"."auth_token" = ? LIMIT ?  [["auth_token", "JiQXdKsSvXg8i8tLREH7sDVZ"], ["LIMIT", 1]]
---
  def userprofile
    user = User.find_by_auth_token!(request.headers[:token])

SELECT "users".* FROM "users" WHERE "users"."admin" = ?  [["admin", "f"]]
---
  def getAllUsers
    users = User.all.where(admin: false)